<a target="_blank" href="https://colab.research.google.com/github/victorlymarev/pandas/blob/main/notebooks/11-functions.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Функции в Pandas
#### [Ссылка на видео](https://youtu.be/cq2aQ0bwFB8)

In [1]:
import pandas as pd
import numpy as np

Создаем таблицу

In [2]:
df = pd.DataFrame({'Колонка 1': [111, 222, 333, 444, 555, 666],
              'Колонка 2': [6, 5, 4, 3, 2, 1],
              'Колонка 3': [np.nan, -3, 5, 0, 9, -11],
              'Имя': ['Миша', 'Саша', 'Юля',
                            'Настя', 'Андрей', 'Катя'],
              'Увлечение': ['Баскетбол', 'Хоккей', 'Волейбол',
                            'Футбол', 'Counter-Strike', 'Баскетбол']
             })

In [3]:
df

   Колонка 1  Колонка 2  Колонка 3     Имя       Увлечение
0        111          6        NaN    Миша       Баскетбол
1        222          5       -3.0    Саша          Хоккей
2        333          4        5.0     Юля        Волейбол
3        444          3        0.0   Настя          Футбол
4        555          2        9.0  Андрей  Counter-Strike
5        666          1      -11.0    Катя       Баскетбол

## Функции из numpy

#### Извлечение натурального лагарифма

In [4]:
df['Колонка 1']

0    111
1    222
2    333
3    444
4    555
5    666
Name: Колонка 1, dtype: int64

In [5]:
np.log(df['Колонка 1'])

0    4.709530
1    5.402677
2    5.808142
3    6.095825
4    6.318968
5    6.501290
Name: Колонка 1, dtype: float64

In [6]:
np.log(df['Колонка 1'] - 333)

/home/artemiy/miniforge-pypy3/envs/artemiy/lib/python3.11/site-packages/pandas/core/arraylike.py:399: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)
/home/artemiy/miniforge-pypy3/envs/artemiy/lib/python3.11/site-packages/pandas/core/arraylike.py:399: RuntimeWarning: invalid value encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

0         NaN
1         NaN
2        -inf
3    4.709530
4    5.402677
5    5.808142
Name: Колонка 1, dtype: float64

#### Извлечение логарифма по произвольному основанию

In [7]:
# Логарифм по основанию 3
np.emath.logn(3, df['Колонка 1'])

array([4.28679913, 4.91772888, 5.28679913, 5.54865864, 5.75177265,
       5.91772888])

#### Синус

In [8]:
np.sin(df['Колонка 1'])

0   -0.864551
1    0.868951
2   -0.008821
3   -0.860085
4    0.873283
5   -0.017642
Name: Колонка 1, dtype: float64

#### Косинус

In [9]:
np.cos(df['Колонка 1'])

0   -0.502544
1   -0.494898
2    0.999961
3   -0.510151
4   -0.487214
5    0.999844
Name: Колонка 1, dtype: float64

In [10]:
df = df.assign(col_1_natural_log = lambda x: np.log(x['Колонка 1']))
df

   Колонка 1  Колонка 2  Колонка 3     Имя       Увлечение  col_1_natural_log
0        111          6        NaN    Миша       Баскетбол           4.709530
1        222          5       -3.0    Саша          Хоккей           5.402677
2        333          4        5.0     Юля        Волейбол           5.808142
3        444          3        0.0   Настя          Футбол           6.095825
4        555          2        9.0  Андрей  Counter-Strike           6.318968
5        666          1      -11.0    Катя       Баскетбол           6.501290

## Методы из пандаса

#### Извлечение модуля числа

In [11]:
df['Колонка 3']

0     NaN
1    -3.0
2     5.0
3     0.0
4     9.0
5   -11.0
Name: Колонка 3, dtype: float64

In [12]:
df['Колонка 3'].abs()

0     NaN
1     3.0
2     5.0
3     0.0
4     9.0
5    11.0
Name: Колонка 3, dtype: float64

### Округление

In [13]:
df['col_1_natural_log']

0    4.709530
1    5.402677
2    5.808142
3    6.095825
4    6.318968
5    6.501290
Name: col_1_natural_log, dtype: float64

In [14]:
df['col_1_natural_log'].round()

0    5.0
1    5.0
2    6.0
3    6.0
4    6.0
5    7.0
Name: col_1_natural_log, dtype: float64

In [15]:
np.log10(df['Колонка 1']).round(1)

0    2.0
1    2.3
2    2.5
3    2.6
4    2.7
5    2.8
Name: Колонка 1, dtype: float64

In [16]:
np.log10(df['Колонка 1']).round(5)

0    2.04532
1    2.34635
2    2.52244
3    2.64738
4    2.74429
5    2.82347
Name: Колонка 1, dtype: float64

#### Округление до десятков и до сотен

In [17]:
df['Колонка 1']

0    111
1    222
2    333
3    444
4    555
5    666
Name: Колонка 1, dtype: int64

In [18]:
df['Колонка 1'].round(-1)

0    110
1    220
2    330
3    440
4    560
5    670
Name: Колонка 1, dtype: int64

In [19]:
df['Колонка 1'].round(-2)

0    100
1    200
2    300
3    400
4    600
5    700
Name: Колонка 1, dtype: int64

#### Огругление вверх

In [20]:
df['col_1_natural_log']

0    4.709530
1    5.402677
2    5.808142
3    6.095825
4    6.318968
5    6.501290
Name: col_1_natural_log, dtype: float64

In [21]:
np.ceil(df['col_1_natural_log'])

0    5.0
1    6.0
2    6.0
3    7.0
4    7.0
5    7.0
Name: col_1_natural_log, dtype: float64

#### Огругление вниз

In [22]:
np.floor(df['col_1_natural_log'])

0    4.0
1    5.0
2    5.0
3    6.0
4    6.0
5    6.0
Name: col_1_natural_log, dtype: float64

#### Накопленная сумма

In [23]:
df['Колонка 2']

0    6
1    5
2    4
3    3
4    2
5    1
Name: Колонка 2, dtype: int64

In [24]:
df['Колонка 2'].cumsum()

0     6
1    11
2    15
3    18
4    20
5    21
Name: Колонка 2, dtype: int64

#### Накопленное произведение

In [25]:
df['Колонка 2'].cumprod()

0      6
1     30
2    120
3    360
4    720
5    720
Name: Колонка 2, dtype: int64

#### Накопленный минимум и максимум

In [26]:
df['Колонка 2'].cummin()
# df['Колонка 1'].cummax()

0    6
1    5
2    4
3    3
4    2
5    1
Name: Колонка 2, dtype: int64

#### Пропущенные значения просто игнорируются

In [27]:
df['Колонка 3']

0     NaN
1    -3.0
2     5.0
3     0.0
4     9.0
5   -11.0
Name: Колонка 3, dtype: float64

In [28]:
df['Колонка 3'].cumprod()

0     NaN
1    -3.0
2   -15.0
3    -0.0
4    -0.0
5     0.0
Name: Колонка 3, dtype: float64

#### Те же операции можно выполнять и для датафреймов если они опеределены

In [29]:
df.iloc[:, :3]

   Колонка 1  Колонка 2  Колонка 3
0        111          6        NaN
1        222          5       -3.0
2        333          4        5.0
3        444          3        0.0
4        555          2        9.0
5        666          1      -11.0

In [30]:
df.iloc[:, :3].cumprod()

          Колонка 1  Колонка 2  Колонка 3
0               111          6        NaN
1             24642         30       -3.0
2           8205786        120      -15.0
3        3643368984        360       -0.0
4     2022069786120        720       -0.0
5  1346698477555920        720        0.0

#### Можно настраивать ось, вдоль которой будет действовать метод

In [31]:
df.iloc[:, :3].cumprod(axis=1)

   Колонка 1  Колонка 2  Колонка 3
0      111.0      666.0        NaN
1      222.0     1110.0    -3330.0
2      333.0     1332.0     6660.0
3      444.0     1332.0        0.0
4      555.0     1110.0     9990.0
5      666.0      666.0    -7326.0

#### is_monotonic_increasing

Проверяет возрастает ли ряд

In [32]:
df['Колонка 1'].is_monotonic_increasing

True

#### is_monotonic_decreasing
Проверяет убывает ли ряд

In [33]:
df['Колонка 1'].is_monotonic_decreasing

False

#### Стандартные функции

In [34]:
len(df['Колонка 1'])

6

In [35]:
sum(df['Колонка 1'])

2331

In [36]:
abs(df['Колонка 3'])

0     NaN
1     3.0
2     5.0
3     0.0
4     9.0
5    11.0
Name: Колонка 3, dtype: float64

In [37]:
min(df['Колонка 1'])

111

In [ ]:
max(df['Колонка 1'])

In [ ]:
max(df['Колонка 3'])

In [ ]:
sum(df['Колонка 3'])

## replace

Ипользуется для замены одних значений другими

In [38]:
df['Увлечение']

0         Баскетбол
1            Хоккей
2          Волейбол
3            Футбол
4    Counter-Strike
5         Баскетбол
Name: Увлечение, dtype: object

#### Чаще всего в него передается словарь, в котором сначала указывается старое значение, а затем новое

In [39]:
df['Увлечение'].replace({'Баскетбол': 'Dota'})

0              Dota
1            Хоккей
2          Волейбол
3            Футбол
4    Counter-Strike
5              Dota
Name: Увлечение, dtype: object

#### В метод можно передать сначала список из старых значений, а затем список из новых

In [40]:
# Поменяем хоккей на футбол, а футбол на хоккей
df['Увлечение'].replace(['Хоккей', 'Футбол'], ['Бильярд', 'Боулинг'])

0         Баскетбол
1           Бильярд
2          Волейбол
3           Боулинг
4    Counter-Strike
5         Баскетбол
Name: Увлечение, dtype: object

#### Можно сначала указать список из старых, а затем новое название

In [41]:
df['Увлечение'].replace(['Хоккей', 'Футбол'], 'Дартс')

0         Баскетбол
1             Дартс
2          Волейбол
3             Дартс
4    Counter-Strike
5         Баскетбол
Name: Увлечение, dtype: object

In [42]:
df

   Колонка 1  Колонка 2  Колонка 3     Имя       Увлечение  col_1_natural_log
0        111          6        NaN    Миша       Баскетбол           4.709530
1        222          5       -3.0    Саша          Хоккей           5.402677
2        333          4        5.0     Юля        Волейбол           5.808142
3        444          3        0.0   Настя          Футбол           6.095825
4        555          2        9.0  Андрей  Counter-Strike           6.318968
5        666          1      -11.0    Катя       Баскетбол           6.501290

In [48]:
df = df.rename({'Увлечение1':'Увлечение'}, axis=1)
df

   Колонка 1  Колонка 2  Колонка 3     Имя       Увлечение  col_1_natural_log
0        111          6        NaN    Миша       Баскетбол           4.709530
1        222          5       -3.0    Саша          Хоккей           5.402677
2        333          4        5.0     Юля        Волейбол           5.808142
3        444          3        0.0   Настя          Футбол           6.095825
4        555          2        9.0  Андрей  Counter-Strike           6.318968
5        666          1      -11.0    Катя       Баскетбол           6.501290

### Метод repalace для датафреймов

In [49]:
df

   Колонка 1  Колонка 2  Колонка 3     Имя       Увлечение  col_1_natural_log
0        111          6        NaN    Миша       Баскетбол           4.709530
1        222          5       -3.0    Саша          Хоккей           5.402677
2        333          4        5.0     Юля        Волейбол           5.808142
3        444          3        0.0   Настя          Футбол           6.095825
4        555          2        9.0  Андрей  Counter-Strike           6.318968
5        666          1      -11.0    Катя       Баскетбол           6.501290

#### Метод можно применить сразу ко всему датафрейму

In [50]:
df.replace({'Баскетбол': 'Dota', 5: 1000})

   Колонка 1  Колонка 2  Колонка 3     Имя       Увлечение  col_1_natural_log
0        111          6        NaN    Миша            Dota           4.709530
1        222       1000       -3.0    Саша          Хоккей           5.402677
2        333          4     1000.0     Юля        Волейбол           5.808142
3        444          3        0.0   Настя          Футбол           6.095825
4        555          2        9.0  Андрей  Counter-Strike           6.318968
5        666          1      -11.0    Катя            Dota           6.501290

#### А можно к каждой отдельной колонке

In [51]:
df.replace({'Имя': {'Андрей': 'Сергей'}})

   Колонка 1  Колонка 2  Колонка 3     Имя       Увлечение  col_1_natural_log
0        111          6        NaN    Миша       Баскетбол           4.709530
1        222          5       -3.0    Саша          Хоккей           5.402677
2        333          4        5.0     Юля        Волейбол           5.808142
3        444          3        0.0   Настя          Футбол           6.095825
4        555          2        9.0  Сергей  Counter-Strike           6.318968
5        666          1      -11.0    Катя       Баскетбол           6.501290

## map

#### Заменяет значения указанные в словаре, но для остальных значений проставляет пропуск

In [52]:
df['Увлечение'].map({'Баскетбол': 'Dota'})

0    Dota
1     NaN
2     NaN
3     NaN
4     NaN
5    Dota
Name: Увлечение, dtype: object

In [53]:
df['Увлечение'].map(lambda x: {'Баскетбол': 'Dota'}.get(x, x))

0              Dota
1            Хоккей
2          Волейбол
3            Футбол
4    Counter-Strike
5              Dota
Name: Увлечение, dtype: object

## Методы для работы с функциями

Векторизованные и невекторизованные функции

Векторизованные функции - это функции, которые на вход принимают колонку таблицы, таблицу или ndarray

Большинство функций и методов в numpy и pandas - векторизованные

In [54]:
df['Колонка 1']

0    111
1    222
2    333
3    444
4    555
5    666
Name: Колонка 1, dtype: int64

In [55]:
np.log(df['Колонка 1'])

0    4.709530
1    5.402677
2    5.808142
3    6.095825
4    6.318968
5    6.501290
Name: Колонка 1, dtype: float64

In [56]:
from math import log

In [57]:
log(df['Колонка 1'])

TypeError: cannot convert the series to <class 'float'>

In [58]:
pd.Series([log(i) for i in df['Колонка 1']])

0    4.709530
1    5.402677
2    5.808142
3    6.095825
4    6.318968
5    6.501290
dtype: float64

## apply

В случае если функция не векторизованная, то метод применяет ее к каждой строке

In [59]:
df['Колонка 1'].apply(np.log)

0    4.709530
1    5.402677
2    5.808142
3    6.095825
4    6.318968
5    6.501290
Name: Колонка 1, dtype: float64

In [60]:
np.log(df['Колонка 1'])

0    4.709530
1    5.402677
2    5.808142
3    6.095825
4    6.318968
5    6.501290
Name: Колонка 1, dtype: float64

In [61]:
df['Колонка 1'].apply(log)

0    4.709530
1    5.402677
2    5.808142
3    6.095825
4    6.318968
5    6.501290
Name: Колонка 1, dtype: float64

#### По умолчанию метод apply применяет функцию к каждому столбцу по очереди. Но чаще нужно применить фунцию к каждой строке. Чтобы это сделать необходимо в параметр axis передать значение 1

In [62]:
df.apply(lambda x: x['Имя'] + ' любит играть в ' + x['Увлечение'], axis=1)

0           Миша любит играть в Баскетбол
1              Саша любит играть в Хоккей
2             Юля любит играть в Волейбол
3             Настя любит играть в Футбол
4    Андрей любит играть в Counter-Strike
5           Катя любит играть в Баскетбол
dtype: object

### applymap

Применяет какую-то функцию к каждой ячеке таблицы

In [63]:
df.iloc[:, :3]

   Колонка 1  Колонка 2  Колонка 3
0        111          6        NaN
1        222          5       -3.0
2        333          4        5.0
3        444          3        0.0
4        555          2        9.0
5        666          1      -11.0

In [66]:
df.iloc[:, :3]

   Колонка 1  Колонка 2  Колонка 3
0        111          6        NaN
1        222          5       -3.0
2        333          4        5.0
3        444          3        0.0
4        555          2        9.0
5        666          1      -11.0

In [64]:
df.iloc[:, :3].applymap(lambda x: x ** 2)

/tmp/ipykernel_215518/2831871443.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.iloc[:, :3].applymap(lambda x: x ** 2)

   Колонка 1  Колонка 2  Колонка 3
0      12321         36        NaN
1      49284         25        9.0
2     110889         16       25.0
3     197136          9        0.0
4     308025          4       81.0
5     443556          1      121.0

In [67]:
df.iloc[:, :3].applymap(lambda x: x / 100)

/tmp/ipykernel_215518/2732378487.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.iloc[:, :3].applymap(lambda x: x / 100)

   Колонка 1  Колонка 2  Колонка 3
0       1.11       0.06        NaN
1       2.22       0.05      -0.03
2       3.33       0.04       0.05
3       4.44       0.03       0.00
4       5.55       0.02       0.09
5       6.66       0.01      -0.11

### transform

Модифицирует колонку или датафрейм при помощи векторной функции. Возвращает тоже колонку или датафрейм

In [68]:
df['Колонка 1']

0    111
1    222
2    333
3    444
4    555
5    666
Name: Колонка 1, dtype: int64

In [69]:
df['Колонка 1'].transform(lambda x: (x - 10) / 10)

0    10.1
1    21.2
2    32.3
3    43.4
4    54.5
5    65.6
Name: Колонка 1, dtype: float64

In [71]:
df

   Колонка 1  Колонка 2  Колонка 3     Имя       Увлечение  col_1_natural_log
0        111          6        NaN    Миша       Баскетбол           4.709530
1        222          5       -3.0    Саша          Хоккей           5.402677
2        333          4        5.0     Юля        Волейбол           5.808142
3        444          3        0.0   Настя          Футбол           6.095825
4        555          2        9.0  Андрей  Counter-Strike           6.318968
5        666          1      -11.0    Катя       Баскетбол           6.501290

Применяем к датафрейму и дополнительно указываем ось если это необходимо

In [70]:
df.iloc[:, :3].transform(lambda x: x / len(x), axis=1)

   Колонка 1  Колонка 2  Колонка 3
0       37.0   2.000000        NaN
1       74.0   1.666667  -1.000000
2      111.0   1.333333   1.666667
3      148.0   1.000000   0.000000
4      185.0   0.666667   3.000000
5      222.0   0.333333  -3.666667

### pipe

Применяет функцию, которая на вход принимает датафрейм целиком

In [72]:
df.pipe(lambda x: x.shape)

(6, 6)

In [73]:
def create_columns(df, n_cols):
    df = df.copy()
    for i in range(n_cols):
        df[f'Колонка {i + 1}'] = i + 1
    return df

In [74]:
df.pipe(create_columns, 9)

,Колонка 1,Колонка 2,Колонка 3,Имя,Увлечение,col_1_natural_log,Колонка 4,Колонка 5,Колонка 6,Колонка 7,Колонка 8,Колонка 9
0,1,2,3,Миша,Баскетбол,4.709530,4,5,6,7,8,9
1,1,2,3,Саша,Хоккей,5.402677,4,5,6,7,8,9
2,1,2,3,Юля,Волейбол,5.808142,4,5,6,7,8,9
3,1,2,3,Настя,Футбол,6.095825,4,5,6,7,8,9
4,1,2,3,Андрей,Counter-Strike,6.318968,4,5,6,7,8,9
5,1,2,3,Катя,Баскетбол,6.501290,4,5,6,7,8,9

| Название метода   | Что принимает на вход      | Особенности                                          |
|:-----------------:|:--------------------------:|:----------------------------------------------------:|
| apply             | Колонку или строку таблицы | Может работать с невекторизованными функциями        |
| applymap          | Ячеку таблицы              | Применяет функцию к каждой чеке                      |
| transform         | Колонку или строку         | Работает только с векторизованными функциями         |
| pipe              | Таблицу целиком            | -                                                    |

# Задания

#### Описание таблиц лежит [здесь](https://github.com/victorlymarev/pandas/tree/main/tables#%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5-%D1%82%D0%B0%D0%B1%D0%BB%D0%B8%D1%86)

Некоторые таблицы занимают много памяти, поэтому каждые 5-10 заданий лучше перезапускайте ноутбук.

В формулировке некоторых заданий может содержаться вариативность. Если у вас есть сомнения, что требуется в задании, попробуйте решить несколько вариантов. Если вы не понимаете задание, можете написать об этом в комментариях под видео.

В большинстве случаев внешний вид итоговой таблицы не определен. Выведите на экран наиболее адекватный вариант. То есть таблицу, из которой можно будет сделать выводы.

Курс пока находится в разработке. Вы можете помочь другим людям добавив свое решение [сюда](https://docs.google.com/forms/d/1HYTBz_KfssY3Jps2dC3n0YnEqa6WBb5OIhLo1d32Xzw/edit).

Посмотреть решения других людей можно [здесь](https://docs.google.com/spreadsheets/d/1pMDYO-9UneLbPPnEuQ2shig0TOJdQTU-zipifyAnZMk/edit?resourcekey#gid=1998648012)

### Задание 1

В таблице df представлены платежи по кредиту. Необходимо для каждой даты посчитать, сколько денег было заплачено.

In [75]:
import pandas as pd

df = pd.DataFrame({'Дата': pd.date_range('2022-01-31', '2022-12-31', freq='M'),
              'Сумма': [(50000 * (1.12 ** (i / 12))) // 1 for i in range(12)]})
df

/tmp/ipykernel_215518/3640865844.py:3: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df = pd.DataFrame({'Дата': pd.date_range('2022-01-31', '2022-12-31', freq='M'),

         Дата    Сумма
0  2022-01-31  50000.0
1  2022-02-28  50474.0
2  2022-03-31  50953.0
3  2022-04-30  51436.0
4  2022-05-31  51924.0
5  2022-06-30  52417.0
6  2022-07-31  52915.0
7  2022-08-31  53417.0
8  2022-09-30  53923.0
9  2022-10-31  54435.0
10 2022-11-30  54952.0
11 2022-12-31  55473.0

In [84]:
df['cumsum'] = df['Сумма'].cumsum()
df

         Дата    Сумма    cumsum
0  2022-01-31  50000.0   50000.0
1  2022-02-28  50474.0  100474.0
2  2022-03-31  50953.0  151427.0
3  2022-04-30  51436.0  202863.0
4  2022-05-31  51924.0  254787.0
5  2022-06-30  52417.0  307204.0
6  2022-07-31  52915.0  360119.0
7  2022-08-31  53417.0  413536.0
8  2022-09-30  53923.0  467459.0
9  2022-10-31  54435.0  521894.0
10 2022-11-30  54952.0  576846.0
11 2022-12-31  55473.0  632319.0

In [85]:
df.groupby("Дата")["Сумма"].sum().reset_index(name="Сумма за день")

         Дата  Сумма за день
0  2022-01-31        50000.0
1  2022-02-28        50474.0
2  2022-03-31        50953.0
3  2022-04-30        51436.0
4  2022-05-31        51924.0
5  2022-06-30        52417.0
6  2022-07-31        52915.0
7  2022-08-31        53417.0
8  2022-09-30        53923.0
9  2022-10-31        54435.0
10 2022-11-30        54952.0
11 2022-12-31        55473.0

### Задание 2

У каждого сотрудника есть оценка. Сейчас она считается от 1 до 10 включительно. Сделайте так, чтобы границы оценки лежали на отрезке от 0 до 1 (любым способом)

In [89]:
import os
import pandas as pd

path_empl = '../tables/employees.parquet' if os.path.exists('../tables/employees.parquet') else 'https://drive.google.com/uc?id=1AARD5-eVlCxoApt5CYZebrC3Cqw42lvj'

empl = pd.read_parquet(path_empl)
empl.head()

,report_dt,i_pernr,fio,sex,shop_id,pos_name,pos_id,closest_boss_pos_id,mgmt_flag,salary_fork,birth_date,education,employee_evaluation,salary
0,2015-01-31,100000,Кожевников Андрей Максимович,мужской,1,Директор магазина,11,<NA>,1,0,1987-03-11,высшее,5.0,45700.0
1,2015-01-31,0,Дубинина Надежда Николаевна,женский,1,Старший кассир,12,11,0,0,1971-07-07,среднее профессиональное,5.0,20000.0
2,2015-01-31,1,Вишневскиая Валентина Константиновна,женский,1,Кассир,13,12,0,0,1974-11-29,среднее общее,5.0,12600.0
3,2015-01-31,2,Литвинов Александр Максимович,мужской,1,Кассир,14,12,0,0,1969-11-01,среднее общее,3.0,12600.0
4,2015-01-31,3,Черняева Валерия Глебовна,женский,1,Продавец-консультант,17,11,0,0,1988-07-17,среднее общее,NaN,15400.0

In [90]:
empl["employee_evaluation"] = empl["employee_evaluation"].apply(lambda x: x / 10)
empl

,report_dt,i_pernr,fio,sex,shop_id,pos_name,pos_id,closest_boss_pos_id,mgmt_flag,salary_fork,birth_date,education,employee_evaluation,salary
0,2015-01-31,100000,Кожевников Андрей Максимович,мужской,1,Директор магазина,11,<NA>,1,0,1987-03-11,высшее,0.5,45700.0
1,2015-01-31,0,Дубинина Надежда Николаевна,женский,1,Старший кассир,12,11,0,0,1971-07-07,среднее профессиональное,0.5,20000.0
2,2015-01-31,1,Вишневскиая Валентина Константиновна,женский,1,Кассир,13,12,0,0,1974-11-29,среднее общее,0.5,12600.0
3,2015-01-31,2,Литвинов Александр Максимович,мужской,1,Кассир,14,12,0,0,1969-11-01,среднее общее,0.3,12600.0
4,2015-01-31,3,Черняева Валерия Глебовна,женский,1,Продавец-консультант,17,11,0,0,1988-07-17,среднее общее,NaN,15400.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29367,2022-12-31,1372,Морозова Раиса Ярославовна,женский,23,Продавец-консультант,2325,232,0,2,1962-01-13,среднее профессиональное,0.6,38000.0
29368,2022-12-31,1615,Фадеева Евгения Данииловна,женский,23,Товаровед,2326,233,0,1,1989-07-12,среднее общее,0.6,31800.0
29369,2022-12-31,1748,Измайлов Григорий Артемович,мужской,23,Товаровед,2327,233,0,0,1989-12-23,среднее общее,0.3,28400.0
29370,2022-12-31,1616,Русаков Евгений Тимурович,мужской,23,Мастер по ремонту одежды,2328,232,0,2,1963-09-19,среднее профессиональное,0.7,35500.0
29371,2022-12-31,1687,Суханова Дарья Фёдоровна,женский,23,Уборщик,2329,232,0,2,1989-08-10,среднее профессиональное,0.8,26400.0

### Задание 3

Создайте колонку таблицы в которой будут лежать все нечетные числа от 1 до 99 включительно. Найдите накопленную сумму

In [ ]:
import pandas as pd
import numpy as np

# Напишите свой код здесь

In [98]:
df1 = pd.DataFrame(np.arange(1, 99), columns=['Номер']).reset_index(drop=True)
df1['cumsum'] = df1['Номер'].cumsum()
df1

    Номер  cumsum
0       1       1
1       2       3
2       3       6
3       4      10
4       5      15
..    ...     ...
93     94    4465
94     95    4560
95     96    4656
96     97    4753
97     98    4851

[98 rows x 2 columns]

### Задание 4

В колонке gender таблицы goods_descr поменяйте значение Men на мужской, а значение Women на женский. Учите, что в колонке есть еще одно значение Unisex. Не делайте из него NaN

In [99]:
import os
import pandas as pd

path_goods_descr = '../tables/goods_description.parquet' if os.path.exists('../tables/goods_description.parquet') else 'https://drive.google.com/uc?id=1YbiD02Rev-X_WWV9nPSG1zZFmEh2JjPh'

goods_descr = pd.read_parquet(path_goods_descr)
goods_descr.head()

,product_name,brand,description,product_code_1,product_code_2,product_code_3,gender,is_no_size,is_one_size,product_type,size_long,size_short,seller,colour,url
0,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638356,Men,False,False,Рубашки,XS - Chest 32-34,XS,<NA>,Brown,https://www.asos.com/river-island/river-island...
1,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638358,Men,False,False,Рубашки,S - Chest 35-37,S,<NA>,Brown,https://www.asos.com/river-island/river-island...
2,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638360,Men,False,False,Рубашки,M - Chest 38-40,M,<NA>,Brown,https://www.asos.com/river-island/river-island...
3,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638351,Men,False,False,Рубашки,L - Chest 41-43,L,<NA>,Brown,https://www.asos.com/river-island/river-island...
4,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638354,Men,False,False,Рубашки,XL - Chest 44-46,XL,<NA>,Brown,https://www.asos.com/river-island/river-island...

In [101]:
goods_descr['gender'] = goods_descr['gender'].replace({'Men':'Мужской', 'Women':'Женский'})
goods_descr

,product_name,brand,description,product_code_1,product_code_2,product_code_3,gender,is_no_size,is_one_size,product_type,size_long,size_short,seller,colour,url
0,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638356,Мужской,False,False,Рубашки,XS - Chest 32-34,XS,<NA>,Brown,https://www.asos.com/river-island/river-island...
1,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638358,Мужской,False,False,Рубашки,S - Chest 35-37,S,<NA>,Brown,https://www.asos.com/river-island/river-island...
2,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638360,Мужской,False,False,Рубашки,M - Chest 38-40,M,<NA>,Brown,https://www.asos.com/river-island/river-island...
3,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638351,Мужской,False,False,Рубашки,L - Chest 41-43,L,<NA>,Brown,https://www.asos.com/river-island/river-island...
4,River Island slim shacket in brown,River Island,Shirts by River Island Do the smart thing Spre...,0,204638347,204638354,Мужской,False,False,Рубашки,XL - Chest 44-46,XL,<NA>,Brown,https://www.asos.com/river-island/river-island...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
81853,Missguided faux leather legging in black,Missguided,Leggings by Missguided Go with the faux High r...,34589,201010335,201010345,Женский,False,False,Леггинсы,UK 14,XL,<NA>,Black,https://www.asos.com/missguided/missguided-fau...
81854,Missguided faux leather legging in black,Missguided,Leggings by Missguided Go with the faux High r...,34589,201010335,201010348,Женский,False,False,Леггинсы,UK 16,XL,<NA>,Black,https://www.asos.com/missguided/missguided-fau...
81855,NaaNaa high waisted split hem tailored trouser...,NaaNaa,Trousers by NaaNaa For your non-denim days Dog...,34591,22841598,22842063,Женский,False,False,Брюки,UK 8,S,<NA>,Dogtooth,https://www.asos.com/naanaa/naanaa-high-waiste...
81856,NaaNaa high waisted split hem tailored trouser...,NaaNaa,Trousers by NaaNaa For your non-denim days Dog...,34591,22841598,22841683,Женский,False,False,Брюки,UK 6,XS,<NA>,Dogtooth,https://www.asos.com/naanaa/naanaa-high-waiste...
81857,NaaNaa high waisted split hem tailored trouser...,NaaNaa,Trousers by NaaNaa For your non-denim days Dog...,34591,22841598,22841999,Женский,False,False,Брюки,UK 10,M,<NA>,Dogtooth,https://www.asos.com/naanaa/naanaa-high-waiste...

In [103]:
goods_descr['gender'].value_counts()

gender
Женский    45763
Мужской    33569
Unisex      2526
Name: count, dtype: int64

### Задание 5

Создайте колонку, состоящую из нечетных чисел от 1 до 1000000. Затем разделите 1 на эту колонку. Полученный результат сохраните в переменную s. После этого каждый второй элемент в колонке умножьте на -1 (это можно сделать при помощи метода iloc s.iloc[1::2] = - s.iloc[1::2]). Умножьте каждое значение в этой колонке на 4. В конце посчитайте накопленную сумму.

На какое число похожи нижние значения в колонке?

In [104]:
import pandas as pd
import numpy as np

s = pd.Series(1 / pd.Series(range(1, 1_000_000, 2)))

In [105]:
s.iloc[1::2] = -s.iloc[1::2]

In [108]:
s *= 4
s

0         64.000000
1        -21.333333
2         12.800000
3         -9.142857
4          7.111111
            ...
499995    -0.000064
499996     0.000064
499997    -0.000064
499998     0.000064
499999    -0.000064
Length: 500000, dtype: float64

In [110]:
s_cumsum = s.cumsum()
s_cumsum

0         64.000000
1         42.666667
2         55.466667
3         46.323810
4         53.434921
            ...
499995    50.265450
499996    50.265514
499997    50.265450
499998    50.265514
499999    50.265450
Length: 500000, dtype: float64

### Задание 6

Сгенерируйте числа от 1 до 100000 с шагом 1. Затем на их основе создайте колонку. Разделите 1 на эту колонку. Затем полученный массив возведите в квадрат. Домножьте на 6. Посчитайте накопленную сумму. В конце извлечите из каждого значения в колонке квадратный корень

In [ ]:
import pandas as pd
import numpy as np

# Напишите свой код здесь

### Задание 7

Посчитайте натуральный логарифм зарплат. Значение округлите до 2 знаков после запятой

In [117]:
import os
import pandas as pd

path_empl = '../tables/employees.parquet' if os.path.exists('../tables/employees.parquet') else 'https://drive.google.com/uc?id=1AARD5-eVlCxoApt5CYZebrC3Cqw42lvj'

empl = pd.read_parquet(path_empl)
empl.head()

,report_dt,i_pernr,fio,sex,shop_id,pos_name,pos_id,closest_boss_pos_id,mgmt_flag,salary_fork,birth_date,education,employee_evaluation,salary
0,2015-01-31,100000,Кожевников Андрей Максимович,мужской,1,Директор магазина,11,<NA>,1,0,1987-03-11,высшее,5.0,45700.0
1,2015-01-31,0,Дубинина Надежда Николаевна,женский,1,Старший кассир,12,11,0,0,1971-07-07,среднее профессиональное,5.0,20000.0
2,2015-01-31,1,Вишневскиая Валентина Константиновна,женский,1,Кассир,13,12,0,0,1974-11-29,среднее общее,5.0,12600.0
3,2015-01-31,2,Литвинов Александр Максимович,мужской,1,Кассир,14,12,0,0,1969-11-01,среднее общее,3.0,12600.0
4,2015-01-31,3,Черняева Валерия Глебовна,женский,1,Продавец-консультант,17,11,0,0,1988-07-17,среднее общее,NaN,15400.0

In [125]:
pd.DataFrame(np.log(empl["salary"]).round(2)).replace({"salary":"log_salary"})

       salary
0       10.73
1        9.90
2        9.44
3        9.44
4        9.64
...       ...
29367   10.55
29368   10.37
29369   10.25
29370   10.48
29371   10.18

[29372 rows x 1 columns]

### Задание 8

Найдите угол между двумя векторам.

Для того чтобы это сделать необходимо сначала посчитать скалярное произведение между векторами (через знак @), затем это произведение надо разделить на норму каждого вектора (функция np.linalg.norm или это можно сделать через @ и квадратный корень). Такми образом мы получим косинус угла между двумя векторами. Теперь зная косинус угла необходимо вычеслить сам угол. Для этого необходимо посчитать арккосинус (np.arccos). В результате мы получим угол в раданах. Чтобы привести угол к градусам необходимо угол в радианах умножить на 180 и разделить на число $\pi$ (np.pi)

In [127]:
import numpy as np
x = np.array([6, 0, 1, 5, 5])
y = np.array([1, 4, 5, 2, 0])

In [129]:
sc_um = x @ y

In [134]:
norm_x = np.linalg.norm(x)
norm_y = np.linalg.norm(y)
print(norm_x, norm_y)

9.327379053088816 6.782329983125268

In [136]:
cos_theta = sc_um / (norm_x * norm_y)
cos_theta

0.3319561756448065

In [138]:
np.arccos(cos_theta) * 180 / 3.14

70.64826518912271